USE [广东]
GO
select *into 小区性能KPI峰值0714 from
(SELECT *
  FROM [dbo].[小区性能(KPI)峰值0714_1] UNION all SELECT *
  FROM [dbo].[小区性能(KPI)峰值0714_2])b
GO

USE [广东]
GO
select *into 小区性能KPI峰值0715 from
(SELECT *
  FROM [dbo].[小区性能(KPI)峰值0715_1] UNION all SELECT *
  FROM [dbo].[小区性能(KPI)峰值0715_2])b
GO

USE [广东]
GO
select *into 小区性能KPI峰值0716 from
(SELECT *
  FROM [dbo].[小区性能(KPI)峰值0716_1] UNION all SELECT *
  FROM [dbo].[小区性能(KPI)峰值0716_2])b
GO

 update  [广东].[dbo].[风景区周报周末2] set  [广东].[dbo].[风景区周报周末2].[上行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0714.[上行利用率峰值时段流量（上行流量MB）]  
  from [广东].[dbo].[风景区周报周末2],[广东].dbo.小区性能KPI峰值0714
  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-14'and [广东].[dbo].[风景区周报周末2].CGI=[广东].dbo.小区性能KPI峰值0714.CGI

  update  [广东].[dbo].[风景区周报周末2] set  [广东].[dbo].[风景区周报周末2].[上行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0715.[上行利用率峰值时段流量（上行流量MB）]  
  from [广东].[dbo].[风景区周报周末2],[广东].dbo.小区性能KPI峰值0715
  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-15'and [广东].[dbo].[风景区周报周末2].CGI=[广东].dbo.小区性能KPI峰值0715.CGI

   update  [广东].[dbo].[风景区周报日常2] set  [广东].[dbo].[风景区周报日常2].[上行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0716.[上行利用率峰值时段流量（上行流量MB）]  
  from [广东].[dbo].[风景区周报日常2],[广东].dbo.小区性能KPI峰值0716
  where [广东].[dbo].[风景区周报日常2].[日期]='2018-07-16'and [广东].[dbo].[风景区周报日常2].CGI=[广东].dbo.小区性能KPI峰值0716.CGI

   update  [广东].[dbo].[风景区周报周末2] set  [广东].[dbo].[风景区周报周末2].[下行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0714.[下行利用率峰值时段流量（下行流量MB）]  
  from [广东].[dbo].[风景区周报周末2],[广东].dbo.小区性能KPI峰值0714
  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-14'and [广东].[dbo].[风景区周报周末2].CGI=[广东].dbo.小区性能KPI峰值0714.CGI

  update  [广东].[dbo].[风景区周报周末2] set  [广东].[dbo].[风景区周报周末2].[下行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0715.[下行利用率峰值时段流量（下行流量MB）]  
  from [广东].[dbo].[风景区周报周末2],[广东].dbo.小区性能KPI峰值0715
  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-15'and [广东].[dbo].[风景区周报周末2].CGI=[广东].dbo.小区性能KPI峰值0715.CGI

  update  [广东].[dbo].[风景区周报日常2] set  [广东].[dbo].[风景区周报日常2].[下行利用率峰值时段流量（上行流量MB）]= [广东].dbo.小区性能KPI峰值0716.[下行利用率峰值时段流量（下行流量MB）]  
  from [广东].[dbo].[风景区周报日常2],[广东].dbo.小区性能KPI峰值0716
  where [广东].[dbo].[风景区周报日常2].[日期]='2018-07-16'and [广东].[dbo].[风景区周报日常2].CGI=[广东].dbo.小区性能KPI峰值0716.CGI





  update [广东].[dbo].[风景区周报周末2] set 有效RRC连接最大数=有效RRC连接最大数*1.12  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-14'
    update [广东].[dbo].[风景区周报周末2] set 有效RRC连接最大数=有效RRC连接最大数*1.1  where [广东].[dbo].[风景区周报周末2].[日期]='2018-07-15'
	 update [广东].[dbo].[风景区周报日常2] set 有效RRC连接最大数=有效RRC连接最大数*0.93  where [广东].[dbo].[风景区周报日常2].[日期]='2018-07-16'
	 update [广东].[dbo].[风景区周报日常2] set 有效RRC连接最大数=有效RRC连接最大数*0.93  where [广东].[dbo].[风景区周报日常2].[日期]='2018-07-16'

	update [广东].[dbo].[风景区周报周末2] set [无线接通率(%)]=100 where [广东].[dbo].[风景区周报周末2].[无线接通率(%)]>100
	 update [广东].[dbo].[风景区周报周末2] set [volte无线接通率（%）]=100 where [广东].[dbo].[风景区周报周末2].[volte无线接通率（%）]>100
	 update [广东].[dbo].[风景区周报周末2] set [eSRVCC切换成功率(%)]=100 where [广东].[dbo].[风景区周报周末2].[eSRVCC切换成功率(%)]>100
	
	 [volte无线接通率（%）]
	 [eSRVCC切换成功率(%)]

	 select 日期,[下行利用率峰值时段流量（上行流量MB）],[上行利用率峰值时段流量（上行流量MB）] from [dbo].[风景区周报日常2] where CGI ='460-00-691423-1'

	 
	 select [下行利用率峰值时段流量（下行流量MB）],[上行利用率峰值时段流量（上行流量MB）] from [广东].dbo.小区性能KPI峰值0716 where CGI ='460-00-691423-1'


select 地市,小区ID,[上行PRB平均利用率(v2 8)] from [广东].[dbo].[周平均忙时0709-15] where [上行PRB平均利用率(v2 8)]>1
  select 地市,小区ID,[下行PRB平均利用率(v2 8)] from [广东].[dbo].[周平均忙时0709-15] where [下行PRB平均利用率(v2 8)]>1
  select 地市,小区ID,[PDCCH信道CCE占用率] from [广东].[dbo].[周平均忙时0709-15] where [PDCCH信道CCE占用率]>1