USE [广东]
GO

SELECT ["开始时间"]
      ,[CGI]
      ,[上行流量(KByte)]
      ,[下行流量(KByte)]
      ,[无线接通率(%)]
      ,[无线掉线率(%)]
      ,[无线接通率(QCI 1)(%)]
      ,[E-RAB掉线率(QCI 1)(小区级)(%)]
      ,[eSRVCC切换成功率(%)]
      ,[流量系数]
  FROM [dbo].[全省覆盖率07182] 

  update [广东].[dbo].[全省覆盖率07182] set [广东].[dbo].[全省覆盖率07182].[流量系数]= [广东].[dbo].[三天流量系数].[0714日均4G流量（GB）]  
  from [广东].[dbo].[全省覆盖率07182],[广东].[dbo].[三天流量系数] 
  where 广东.[dbo].[全省覆盖率07182].["开始时间"]='2018-07-14'and 广东.[dbo].[全省覆盖率07182].CGI=[广东].[dbo].[三天流量系数].CGI


  update [广东].[dbo].[全省覆盖率07182] set [广东].[dbo].[全省覆盖率07182].[流量系数]= [广东].[dbo].[三天流量系数].[0715日均4G流量（GB）]  
  from [广东].[dbo].[全省覆盖率07182],[广东].[dbo].[三天流量系数] 
  where 广东.[dbo].[全省覆盖率07182].["开始时间"]='2018-07-15'and 广东.[dbo].[全省覆盖率07182].CGI=[广东].[dbo].[三天流量系数].CGI
  update [广东].[dbo].[全省覆盖率07182] set [广东].[dbo].[全省覆盖率07182].[流量系数]= [广东].[dbo].[三天流量系数].[0716日均4G流量（GB）]  
  from [广东].[dbo].[全省覆盖率07182],[广东].[dbo].[三天流量系数] 
  where 广东.[dbo].[全省覆盖率07182].["开始时间"]='2018-07-16'and 广东.[dbo].[全省覆盖率07182].CGI=[广东].[dbo].[三天流量系数].CGI
    update [广东].[dbo].[全省覆盖率07182] set [广东].[dbo].[全省覆盖率07182].[流量系数] = NULL 
  from [广东].[dbo].[全省覆盖率07182],[广东].[dbo].[三天流量系数] 
  where 广东.[dbo].[全省覆盖率07182].["开始时间"]='2018-07-17'and 广东.[dbo].[全省覆盖率07182].CGI=[广东].[dbo].[三天流量系数].CGI

