USE [容量]
GO

SELECT [a06271].[地市]
      ,[a06271].[小区ID]
      ,[a06271].[小区名称]
	  ,[小区工参].[网格]
	  ,[小区工参].[路测网格]
      ,[a06271].[覆盖场景]
      ,[a06271].[频段]
      ,[a06271].[载波带宽]
	  ,[a06271].[RRC连接最大数]
      ,[a06271].[下行PRB平均利用率(v2 8)]
      ,[a06271].[上行PRB平均利用率(v2 8)]
      ,[a06271].[PDCCH信道CCE占用率]
      ,[a06271].[上行日流量(MB)]
      ,[a06271].[下行日流量(MB)]
	 /* ,round(([a06271].[上行日流量(MB)]+[a06271].[下行日流量(MB)])/1024),2) as 流量GB*/
  into ccc FROM [dbo].[a06271] INNER join [小区工参] on [小区工参].[小区ID]= [a06271].[小区ID] 
GO

